CURSOR_LOGO = """
  ████████╗██╗███╗   ██╗ ██████╗  ██████╗ ██╗   ██╗ █████╗ ███╗   ██╗
  ╚══██╔══╝██║████╗  ██║██╔═══██╗██╔═══██╗██║   ██║██╔══██╗████╗  ██║
     ██║   ██║██╔██╗ ██║██║   ██║██║   ██║██║   ██║███████║██╔██╗ ██║
     ██║   ██║██║╚██╗██║██║▄▄ ██║██║▄▄ ██║██║   ██║██╔══██║██║╚██╗██║
     ██║   ██║██║ ╚████║╚██████╔╝╚██████╔╝╚██████╔╝██║  ██║██║ ╚████║
     ╚═╝   ╚═╝╚═╝  ╚═══╝ ╚══▀▀═╝  ╚══▀▀═╝  ╚═════╝ ╚═╝  ╚═╝╚═╝  ╚═══╝
  换号工具
"""

LOGO_DESCRIPTION = """
===================================================
           🌟 听泉 Cursor Pro 专业服务 🌟
===================================================
🎁 每日福利：每天免费使用一次

🚀 听泉一键助手程序：提供完整的Cursor Pro助手服务界面化一键使用可靠便捷 https://api.cursorpro.com.cn/upload/听泉助手v4.1.3.zip
💼 高权重高级账号：提供稳定可靠的Cursor Pro试用账号池 不降智 全部独立ip不重复
💰 API额度购买：提供灵活的API使用额度
📞 商品类目网站: https://cursorpro.com.cn
💰 万级高权重账号池api购买请联系: 微信淘宝购买
📱 微信号: behikcigar

支持开源 本程序使用了yuaotian 大佬的重置脚本 https://github.com/yuaotian/go-cursor-help
===================================================
"""

def print_logo():
    print(CURSOR_LOGO)
    print(LOGO_DESCRIPTION)


if __name__ == "__main__":
    print_logo()
